    [
        {
            "id": "whitney-quillen",
            "image": "Whitney_Quillen.jpg",
            "name": "WHITNEY QUILLEN",
            "title": "Chief Executive Officer ",
            "mail": "Whitney@StagePointCapital.com",
            "shortdescription": "Prior to joining SPC, Mr. Quillen was the founder and CEO of W. Quillen Securities, a Finra-Member investment bank, formed in 2001 and sold in March 2009. Prior to forming W. Quillen",
            "description": "Prior to joining SPC, Mr. Quillen was the founder and CEO of W. Quillen Securities, a Finra-Member investment bank, formed in 2001 and sold in March 2009. Prior to forming W. Quillen Securities, Mr. Quillen was affiliated with Quilcap Corp, initially as outside counsel, and from 2000 to 2002 as in-house counsel and equity analyst. Quilcap Corp. is a long-short, valueoriented hedge fund. From 1994 to 2000, Mr. Quillen ran his own law practice focusing on commercial litigation, distressed debt resolution, and securities regulation. He has also advised hedge funds on commercial litigation affecting publicly traded equity and has served as Chairman, legal counsel, and member of various creditors’ committees in bankruptcy proceedings. Mr. Quillen is a member of the Bar of the State of New York. He obtained an MBA in Corporate Finance (with Honors) from Pace University’s Lubin Graduate School of Business in 1997, a JD from New York Law School in 1994, and a BA in Political Economics from Skidmore College in 1989."
        },
        {
            "id": "james-d-marver",
            "image": "JAMES_D_MARVER.jpg",
            "name": "JAMES D. MARVER",
            "title": "Co-Founder and Managing Director",
            "mail": "James@StagePointCapital.com",
            "shortdescription": "Co-Founder and Managing Director of VantagePoint Capital PartnersVantagePoint is a registered investment adviser with ~$5 billion of private equity under management which saw the successful IPO or sale of dozens of its portfolio",
            "description": "Co-Founder and Managing Director of VantagePoint Capital PartnersVantagePoint is a registered investment adviser with ~$5 billion of private equity under management which saw the successful IPO or sale of dozens of its portfolio companies, including Tesla Motors (NASDAQ:TSLA, on the board of which Jim served). Jim is also Chairman Emeritus of the Board of Advisors, Goldman School of Public Policy at the University of California, Berkeley, and is a member of the Board of Directors of The National Venture Capital Association (NVCA). Jim attended Williams College (BA) and the University of California, Berkeley (MPP ’74, PhD ’78)."
        },
        {
            "id": "jarret-lilien",
            "image": "JARRETT_LILIEN.jpg",
            "name": "JARRETT LILIEN",
            "title": "President and COO of WisdomTree Investments",
            "mail": "Jarrett@StagePointCapital.com",
            "shortdescription": "President and COO of WisdomTree Investments, Inc. (NASDAQ:WETF) Jarrett is also Vice Chairman of Barton International. Prior to WisdomTree, Jarrett was interim CEO at Investment Technologies Group (NYSE:ITG), Co-founder and CEO of",
            "description": "President and COO of WisdomTree Investments, Inc. (NASDAQ:WETF) Jarrett is also Vice Chairman of Barton International. Prior to WisdomTree, Jarrett was interim CEO at Investment Technologies Group (NYSE:ITG), Co-founder and CEO of TIR Securities, which eventually sold to E*TRADE where he became President and Chief Operating Officer. Previously, Jarrett founded Bendigo Partners, a private equity firm and adviser to some of the world’s largest publicly-traded financial services companies. "
        },
        {
            "id": "joan-fleischmann-tobin",
            "image": "JOAN_FLEISCHMANN_TOBIN.jpg",
            "name": "JOAN FLEISCHMANN TOBIN",
            "title": "Owner, Neapolitan Enterprises LLC",
            "mail": "Joan@StagePointCapital.com",
            "shortdescription": "Owner, Neapolitan Enterprises LLC Based in Naples, FL. Neapolitan Enterprises is a property management company that owns and operates Third Street South, the birthplace of Old Naple",
            "description": "Owner, Neapolitan Enterprises LLC Based in Naples, FL. Neapolitan Enterprises is a property management company that owns and operates Third Street South, the birthplace of Old Naples and one of that city’s largest owners of residential, retail and office properties."
        },
        {
            "id": "haydn-cuiler",
            "image": "HAYDN_CUTLER.jpg",
            "name": "HAYDN CUTLER",
            "title": "Vice President & Manager ",
            "mail": "Haydn@StagePointCapital.com",
            "shortdescription": "Prior to joining Stage Point Capital, Mr. Cutler held executive leadership roles in construction, energy & distribution with a primary focus on markets in the commercial multi-family, government and utility sectors. His executive level experience in finance, distribution ",
            "description": "Prior to joining Stage Point Capital, Mr. Cutler held executive leadership roles in construction, energy & distribution with a primary focus on markets in the commercial multi-family, government and utility sectors. His executive level experience in finance, distribution and construction spans more than 30 years. In addition to serving as a manager of SPC, he also manages 1700 REED, LLC, a real estate investment company and an SPF Fund borrower, operating in the greater Philadelphia market. Prior to 1700 REED, Mr. Cutler served as the CEO of Potomac Resource Group, LLC (PRG) managing a nationwide building material distributor that specialized in construction & sustainable energy projects based in Mclean, VA. Prior to PRG, he was a financial adviser at Prudential Securities in Washington, DC. He earned a BA from Middlebury College in Vermont and earned an MBA from Georgetown University in Washington, DC."
        },
        {
            "id": "paula-bleidorn",
            "image": "",
            "name": "PAULA BLEIDORN",
            "title": "Fund Controller",
            "mail": "Paula@StagePointCapital.com",
            "shortdescription": "Prior to joining Stage Point Capital, Ms. Bleidorn worked as the Corporate Controller for companies in the Legal, Telecommunications and Real Estate Industries. She brings 20+ years of experience in preparing and analyzing financial and operational details for service companies.",
            "description": "Prior to joining Stage Point Capital, Ms. Bleidorn worked as the Corporate Controller for companies in the Legal, Telecommunications and Real Estate Industries. She brings 20+ years of experience in preparing and analyzing financial and operational details for service companies. Ms. Bleidorn earned a BS from the University of Massachusetts, College of Management with a concentration in Accounting and Finance in 1995. She also has served as a Notary Public in Massachusetts since 2005. "
        },
        {
            "id": "clayton-rice",
            "image": "Clayton_Rice.jpg",
            "name": "CLAYTON RICE",
            "title": "Vice President & Loan Analyst ",
            "mail": "Clayton@StagePointCapital.com",
            "shortdescription": "Prior to joining Stage Point Capital, Mr. Rice was an analyst and operations manager at Human Resolution Technologies, LLC (HRT). His duties included accounting, account management, supporting capital allocation decisions, and developing internal healthcare management systems focused on driving company efficiency.",
            "description": "Prior to joining Stage Point Capital, Mr. Rice was an analyst and operations manager at Human Resolution Technologies, LLC (HRT). His duties included accounting, account management, supporting capital allocation decisions, and developing internal healthcare management systems focused on driving company efficiency. Prior to joining HRT, Mr. Rice was a summer associate and financial assistant to Managing Partner at Meads Bay Capital, a BioTech hedge fund where he analyzed IPO’s, attended roadshow presentations and met management teams. Mr. Rice earned a BS in Psychology at the University of St Andrews in 2019, where he captained the Men’s Squash team."
        },
        {
            "id": "scott-furland",
            "image": "SCOTT_FURLAUD.jpg",
            "name": "SCOTT FURLAUD",
            "title": "Mortgage Analyst ",
            "mail": "Scott@StagePointCapital.com",
            "shortdescription": "Prior to joining SPC, Scott was a data scientist for Artorius Capital Management, a private equity fund, where he assembled data, monitored trading, and evaluated performance on all trading strategies within the portfolio. ",
            "description": "Prior to joining SPC, Scott was a data scientist for Artorius Capital Management, a private equity fund, where he assembled data, monitored trading, and evaluated performance on all trading strategies within the portfolio. Prior to Artorius, Scott worked at Third Wave Development as an underwriting associate conducting initial analysis on all incoming properties and assisting the managing partner in capital raising. Scott received his MBA in Finance from The University of Wisconsin, Madison and his BA in Economics from the University of Miami."
        }
    ]
